#Область ОбработчикиКоманд
&НаКлиенте
Процедура СоздатьДемо(Команда)
    Ссылка = СоздатьДемоНаСервере();
    ОткрытьФорму("Документ.ЗаявкаНаЗакупку.ФормаОбъекта", Новый Структура("Ключ", Ссылка));
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьДемоНаСервере()
    Возврат ЗакупкиДемо.Создать();
КонецФункции

&НаКлиенте
Процедура ПроверитьСценарии(Команда)
    ПроверитьСценарииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьСценарииНаСервере()
    ЗакупкиИнтеграционныеТесты.ПроверитьВсе();
КонецПроцедуры
#КонецОбласти
